app/views/qualificacoes/_form.html.erb

SELECT `clientes`.* FROM `clientes`  ORDER BY `clientes`.`nome` ASC
---
    <%= f.label :cliente_id %><br>
    <%= f.collection_select(:cliente_id, Cliente.order(:nome),:id, :nome, :prompt => true) %>

SELECT `lojas`.* FROM `lojas`  ORDER BY `lojas`.`nome` ASC
---
    <%= f.label :loja_id %><br>
    <%= f.collection_select(:loja_id, Loja.order(:nome), :id, :nome, :prompt => true) %>