app/controllers/lojas_controller.rb

		def index
			@lojas = Loja.order :nome
---
SELECT `lojas`.* FROM `lojas`  ORDER BY `lojas`.`nome` ASC

		def show
			@lojas = Loja.find(params[:id])
---
SELECT  `lojas`.* FROM `lojas` WHERE `lojas`.`id` = 1 LIMIT 1

		def destroy
			@lojas = Loja.find(params[:id])
			@lojas.destroy
---
SELECT  `lojas`.* FROM `lojas` WHERE `lojas`.`id` = 1 LIMIT 1
DELETE FROM `lojas` WHERE `lojas`.`id` = 1

		def create
			@lojas = Loja.new loja_params
			if @lojas.save
---
INSERT INTO `lojas` (`nome`, `endereco`, `especialidade`, `created_at`, `updated_at`) VALUES ('Alguma coisa', '', 'Massas', '2016-07-07 22:18:40', '2016-07-07 22:18:40')

		def edit
			@lojas = Loja.find(params[:id])
---
SELECT  `lojas`.* FROM `lojas` WHERE `lojas`.`id` = 1 LIMIT 1

		def update
			@lojas = Loja.find(params[:id])
			if @lojas.update_attributes(loja_params)
---
SELECT  `lojas`.* FROM `lojas` WHERE `lojas`.`id` = 3 LIMIT 1
UPDATE `lojas` SET `nome` = 'So sabor', `endereco` = '', `especialidade` = 'Comida mineira', `updated_at` = '2016-07-07 22:40:12' WHERE `lojas`.`id` = 2